D1/system/pointLocation2.txt
( 19.900 0.900 0.000 )
( 19.981 0.900 0.040 )
( 19.987 0.900 0.129 )
( 19.991 0.900 0.219 )
( 19.993 0.900 0.309 )
( 19.995 0.900 0.400 )
( 19.996 0.900 0.490 )
( 19.997 0.900 0.580 )
( 19.998 0.900 0.670 )
( 19.999 0.900 0.760 )
( 20.000 0.900 0.850 )
