D1/system/pointLocation3.txt
( 20.400 0.000 0.000 )
( 20.319 0.000 0.040 )
( 20.313 0.000 0.129 )
( 20.309 0.000 0.219 )
( 20.307 0.000 0.309 )
( 20.305 0.000 0.400 )
( 20.304 0.000 0.490 )
( 20.303 0.000 0.580 )
( 20.302 0.000 0.670 )
( 20.301 0.000 0.760 )
( 20.300 0.000 0.850 )
